presentations/how-does-openstack-avoid-numbers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(How Does OpenStack Avoid Numbers)</title>
<meta name="author" content="(ZhiQiang Fan)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/reveal.min.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/theme/default.css" id="theme"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/print/pdf.css" type="text/css" media="print"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>How Does OpenStack Avoid Numbers</h1>
<h2>ZhiQiang Fan</h2>
<h2><a href="mailto:aji.zqfan@gmail.com">aji.zqfan@gmail.com</a></h2>
<h2>CC BY-NC-SA 3.0</h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">OpenStack API features</a>
</li>
<li>
<a href="#sec-2">Authentication</a>
</li>
<li>
<a href="#sec-3">Authorization</a>
</li>
<li>
<a href="#sec-4">Exception</a>
</li>
<li>
<a href="#sec-5">Message Internationalization</a>
</li>
<li>
<a href="#sec-6">Thanks To</a>
</li>
</ul>
</section>

<section id="sec-1" >

<h2><span class="section-number-2">1</span> OpenStack API features</h2>
<ul class="org-ul">
<li>ReSTful
</li>
<li>Atomic Responsibility
</li>
<li>Asynchronous
</li>
<li>Configurable
</li>
</ul>

</section>
<section>
<section id="sec-1-1" >

<h3><span class="section-number-3">1.1</span> ReSTful API</h3>
<p>
Lists networks to which the specified tenant has access
</p>

<p>
GET v2/{tenant_id}/networks
</p>
</section>
</section>
<section>
<section id="sec-1-2" >

<h3><span class="section-number-3">1.2</span> Atomic Responsibility</h3>
<ul class="org-ul">
<li>Each resource has CRUD operations
</li>
<li>Each API only do one thing
</li>
<li>Easy to use, hard to composite
</li>
</ul>
</section>
</section>
<section>
<section id="sec-1-3" >

<h3><span class="section-number-3">1.3</span> Asynchronous</h3>
<ul class="org-ul">
<li>Quick API Response
</li>
<li>Robust Agent
</li>
<li>Eventually Consistency
</li>
</ul>
</section>
</section>
<section>
<section id="sec-1-4" >

<h3><span class="section-number-3">1.4</span> Configurable</h3>
<p>
Application pipeline
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ffff00;">keystone</span> = authtoken keystonecontext extensions neutronapiapp_v2_0
</pre>
</div>

<ul class="org-ul">
<li>authtoken: Authentication
</li>
<li>keystonecontext: Context initialization: useri_id, tenant_id, roles
</li>
<li>extensions: Neutron extension api entry
</li>
<li>neutronapiapp_v2_0: Neutron basical api entry
</li>
</ul>
</section>
</section>
<section id="sec-2" >

<h2><span class="section-number-2">2</span> Authentication</h2>
<ul class="org-ul">
<li>Keystone
</li>
<li>Token Based
</li>
<li>User, Role, Group, Tenant, Domain
</li>
<li>Black Box
</li>
</ul>
</section>
<section id="sec-3" >

<h2><span class="section-number-2">3</span> Authorization</h2>
<ul class="org-ul">
<li>Policy: Rule based
</li>
<li>Rule: Role based
</li>
<li>Human Readable
</li>
<li>Configurable
</li>
</ul>

<div class="org-src-container">

<pre class="src src-json">/etc/neutron/policy.json
<span style="color: #00ffff; font-weight: bold;">"get_network"</span>: <span style="color: #00ff00;">"rule:admin_or_owner or rule:shared or rule:external"</span>
</pre>
</div>

</section>
<section>
<section id="sec-3-1" >

<h3><span class="section-number-3">3.1</span> Lower External Network Visibility</h3>
<div class="org-src-container">

<pre class="src src-json">/etc/neutron/policy.json
<span style="color: #00ffff; font-weight: bold;">"get_network"</span>: <span style="color: #00ff00;">"rule:admin_or_owner or rule:shared"</span>
</pre>
</div>
<p>
Restart Neutron service
</p>

<p>
Then external networks are only visiable to admin or owner
</p>
</section>
</section>
<section id="sec-4" >

<h2><span class="section-number-2">4</span> Exception</h2>
<ul class="org-ul">
<li>Inherited Exception
</li>
<li>Map to HTTPException
</li>
<li>Precise Exception Name
</li>
</ul>

</section>
<section>
<section id="sec-4-1" >

<h3><span class="section-number-3">4.1</span> NetworkNotFound</h3>
<ul class="org-ul">
<li>class NeutronException(Exception)
</li>
<li>class NotFound(NeutronException)
</li>
<li>class NetworkNotFound(NotFound)
</li>
</ul>
</section>
</section>
<section>
<section id="sec-4-2" >

<h3><span class="section-number-3">4.2</span> Exception Map to HTTPException</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ffff00;">FAULT_MAP</span> = {exceptions.NotFound: webob.exc.HTTPNotFound,
             exceptions.Conflict: webob.exc.HTTPConflict,
             exceptions.InUse: webob.exc.HTTPConflict,
             exceptions.BadRequest: webob.exc.HTTPBadRequest,
             exceptions.ServiceUnavailable: webob.exc.HTTPServiceUnavailable,
             exceptions.NotAuthorized: webob.exc.HTTPForbidden,
             netaddr.AddrFormatError: webob.exc.HTTPBadRequest,}
</pre>
</div>
</section>
</section>
<section>
<section id="sec-4-3" >

<h3><span class="section-number-3">4.3</span> Human Readable Benefits</h3>
<ul class="org-ul">
<li>System Scenario: unique - ensured by compiler
</li>
<li>Developer Scenario: try&#x2026;except
</li>
<li>Operator Scenario: log
</li>
<li>End User Scenario: fault message
</li>
</ul>
</section>
</section>
<section id="sec-5" >

<h2><span class="section-number-2">5</span> Message Internationalization</h2>
<ul class="org-ul">
<li>gettext
</li>
<li>Runtime Translate
</li>
<li>Auto Collect
</li>
<li>self-identifier
</li>
</ul>

</section>
<section>
<section id="sec-5-1" >

<h3><span class="section-number-3">5.1</span> gettext</h3>
<ul class="org-ul">
<li>Easy to develope
</li>
<li>Easy to deploy
</li>
<li>Easy to translate
</li>
<li>Easy to customize
</li>
</ul>
</section>
</section>
<section>
<section id="sec-5-2" >

<h3><span class="section-number-3">5.2</span> Scenario</h3>
<ul class="org-ul">
<li>Developer
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">NetworkNotFound</span>(NotFound):
    <span style="color: #ffff00;">message</span> = _(<span style="color: #00ff00;">"Network %(net_id)s could not be found"</span>)
</pre>
</div>
<ul class="org-ul">
<li>Operator
</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash">export LC_ALL=zh_TW.UTF-8
</pre>
</div>
<ul class="org-ul">
<li>Translator
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000;">#</span><span style="color: #ff0000;">: neutron/common/exceptions.py:79</span>
<span style="color: #ff0000;">#</span><span style="color: #ff0000;">, python-format</span>
msgid <span style="color: #00ff00;">"Network %(net_id)s could not be found"</span>
msgstr <span style="color: #00ff00;">"&#25214;&#19981;&#21040;&#32178;&#36335; %(net_id)s"</span>
</pre>
</div>
</section>
</section>
<section id="sec-6" >

<h2><span class="section-number-2">6</span> Thanks To</h2>
<ul class="org-ul">
<li>OpenStack
</li>
<li>reveal.js &amp; org-reveal
</li>
</ul>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: false,
        			center: true,
        			rollingLinks: false,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/classList.js', condition: function() { return !document.body.classList; } }
        				,{ src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }
        				,{ src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }
        				,{ src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
         				
        			]
        		});
</script>
</body>
</html>
